
# Brewfile
#
# This file lists all Homebrew packages and dependencies for the setup.
# It can be installed with the `brew bundle` command.

# Official tap for the Bun package
tap "oven-sh/bun"

# CLI Tools & Utilities
brew "bash"
brew "bat"
brew "bun"
brew "btop"
brew "eza"
brew "fd"
brew "ffmpeg"
brew "fish"
brew "fzf"
brew "gh"
brew "ghostscript"
brew "git"
brew "glow"
brew "go"
brew "imagemagick"
brew "jq"
brew "lazydocker"
brew "lazygit"
brew "luarocks"
brew "lynx"
brew "n"
brew "neovim"
brew "nushell"
brew "pnpm"
brew "poppler"
brew "protobuf"
brew "resvg"
brew "ripgrep"
brew "sevenzip"
brew "starship"
brew "tmux"
brew "yazi"
brew "yq"
brew "yarn"
brew "zoxide"

# GUI Applications
cask "arc"
cask "visual-studio-code"

# Fonts (as Casks)
# Note: Fonts are now in the default cask tap, no extra tap needed.
cask "font-caskaydia-cove-nerd-font"
cask "font-victor-mono-nerd-font"
cask "font-symbols-only-nerd-font"
cask "font-jetbrains-mono-nerd-font"
